Repository: KimHyungSik/random_party_pick
Catalog: lib/l10n/app_*.arb
Languages: th

# appTitle
source: Red Card Game
th: เกมการ์ดแดง

# homeScreenTitle
source: Random Party Pick
th: สุ่มเลือกปาร์ตี้

source: Create Room
th: สร้างห้อง

source: Join Room
th: เข้าร่วมห้อง

source: Settings
th: ตั้งค่า

source: Player Name
th: ชื่อผู้เล่น

# enterPlayerName
source: Enter your name
th: ใส่ชื่อของคุณ

source: Room Code
th: รหัสห้อง

source: Enter room code
th: ใส่รหัสห้อง

# numPlayers
source: Number of Players
th: จำนวนผู้เล่น

# numCards
source: Number of Red Cards
th: จำนวนการ์ดแดง

source: Start Game
th: เริ่มเกม

source: Cancel
th: ยกเลิก

source: Join
th: เข้าร่วม

source: Create
th: สร้าง

source: Waiting...
th: กำลังรอ...

# waitingForPlayers
source: Waiting for players to join
th: กำลังรอผู้เล่นเข้าร่วม

# shareRoomCode
source: Share room code with friends
th: แชร์รหัสห้องกับเพื่อน

source: Copied!
th: คัดลอกแล้ว!

source: Game Results
th: ผลลัพธ์เกม

source: Play Again
th: เล่นอีกครั้ง

source: Back to Home
th: กลับสู่หน้าหลัก

source: Loading...
th: กำลังโหลด...

source: Error
th: ข้อผิดพลาด

source: Try Again
th: ลองอีกครั้ง

source: No cards picked
th: ไม่ได้เลือกการ์ด

# youGotCard
source: You got {count, plural, =1 {a card} other {{count} cards}}!
th: คุณได้รับการ์ด {count} ใบ!

source: Language
th: ภาษา

source: Select Language
th: เลือกภาษา

source: English
th: อังกฤษ

source: Korean
th: เกาหลี

source: Thai
th: ไทย

source: French
th: ฝรั่งเศส

source: German
th: เยอรมัน

source: Spanish
th: สเปน

source: Japanese
th: ญี่ปุ่น

source: Kick Player
th: ไล่ผู้เล่นออก

# kickPlayerConfirm
source: Are you sure you want to kick {playerName}?
th: คุณแน่ใจหรือไม่ที่จะไล่ {playerName} ออก?

source: Kick
th: ไล่ออก

# playerKicked
source: {playerName} has been kicked from the room
th: {playerName} ถูกไล่ออกจากห้องแล้ว

source: Leave Room
th: ออกจากห้อง

# leaveRoomConfirm
source: Are you sure you want to leave the room?
th: คุณแน่ใจหรือไม่ที่จะออกจากห้อง?

source: Leave
th: ออก

source: Room not found
th: ไม่พบห้อง

# gameAlreadyStarted
source: Game has already started
th: เกมเริ่มแล้ว

# notEnoughPlayers
source: Need at least 2 players to start
th: ต้องการผู้เล่นอย่างน้อย 2 คนเพื่อเริ่มเกม

# youGotRedCard
source: You got the RED card!
th: คุณได้การ์ดแดง!

# youGotGreenCard
source: You got a GREEN card!
th: คุณได้การ์ดเขียว!

source: Red Card Holder
th: ผู้ถือการ์ดแดง

source: Green Card Holder
th: ผู้ถือการ์ดเขียว

source: Game Finished!
th: เกมจบแล้ว!

source: New Game
th: เกมใหม่

# hostLeft
source: Host has left the room
th: เจ้าของห้องออกจากห้องแล้ว

# newHostIs
source: {playerName} is now the host
th: {playerName} เป็นเจ้าของห้องคนใหม่แล้ว

# roomClosed
source: Room has been closed
th: ห้องถูกปิดแล้ว

# connectionError
source: Connection error. Please try again.
th: ข้อผิดพลาดในการเชื่อมต่อ กรุณาลองใหม่อีกครั้ง

source: Invalid room code
th: รหัสห้องไม่ถูกต้อง

source: Room is full
th: ห้องเต็มแล้ว

# nameAlreadyTaken
source: This name is already taken in the room
th: ชื่อนี้ถูกใช้แล้วในห้อง

# minimumTwoPlayers
source: Need at least 2 players to start the game
th: ต้องการผู้เล่นอย่างน้อย 2 คนเพื่อเริ่มเกม

# redCardCountError
source: Red card count must be less than total players
th: จำนวนการ์ดแดงต้องน้อยกว่าจำนวนผู้เล่นทั้งหมด
